
RAMADAN_ITEMS_ORDER = ["fasting", "athkar", "duaa", "quran", "hadith"]

RAMADAN_ITEMS_META = {
    "fasting": {"label_de": "Fasten", "label_ar": "الصيام", "image": "https://res.cloudinary.com/drlpkuf9q/image/upload/w_400,h_300,c_fill/v1769106860/ChatGPT_Image_22._Jan._2026_19_34_06_cmxzct.jpg"},
    "athkar":  {"label_de": "Athkar", "label_ar": "الأذكار", "image": "https://res.cloudinary.com/drlpkuf9q/image/upload/w_400,h_300,c_fill/v1769108367/ChatGPT_Image_22._Jan._2026_19_59_18_wilnnq.jpg"},
    "duaa":    {"label_de": "Duaa", "label_ar": "الدعاء", "image": "https://res.cloudinary.com/drlpkuf9q/image/upload/w_400,h_300,c_fill/v1769108646/3667038_a84e85abcb6b6a8b7cb55e3cd10b50b6_ulqz2k.jpg"},
    "quran":   {"label_de": "Koran", "label_ar": "القرآن", "image": "https://res.cloudinary.com/drlpkuf9q/image/upload/w_400,h_300,c_fill/v1769108672/OIP_x1q90e.webp"},
    "hadith":  {"label_de": "Hadith", "label_ar": "الحديث", "image": "https://res.cloudinary.com/drlpkuf9q/image/upload/w_400,h_300,c_fill/v1769108844/8xIOHiFRWEU6DwNdTJqFgB05fnQvaLa2h2IPACiB_cwsfpa.webp"},
}

RAMADAN_CONTENT = {
    1: {
        "title": "1 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },

    2: {
        "title": "2 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },

    3: {
        "title": "3 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    4: {
        "title": "4 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    5: {
        "title": "5 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    6: {
        "title": "6 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    7: {
        "title": "7 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    8: {
        "title": "8 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    9: {
        "title": "9 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    10: {
        "title": "10 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    11: {
        "title": "11 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    12: {
        "title": "12 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    13: {
        "title": "13 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    14: {
        "title": "14 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    15: {
        "title": "15 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    16: {
        "title": "16 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    17: {
        "title": "17 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    18: {
        "title": "18 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    19: {
        "title": "19 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
    20: {
        "title": "20 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": "نِيَّةُ الصِّيَامِ ..."},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ..."},
                    {"text": "اللهم بك أصبحنا ..."},
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللهم إنك عفو تحب العفو فاعف عني"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "اقرأ صفحة/جزء ..."}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قال رسول الله ﷺ ..."}],
            },
        },
    },
}
