
RAMADAN_ITEMS_ORDER = ["fasting", "athkar", "duaa", "quran", "hadith"]

RAMADAN_ITEMS_META = {
    "fasting": {"label_de": "Fasten", "label_ar": "الصيام", "image": "https://res.cloudinary.com/drlpkuf9q/image/upload/w_300,h_200,c_fill/v1769106860/ChatGPT_Image_22._Jan._2026_19_34_06_cmxzct.jpg"},
    "athkar":  {"label_de": "Athkar", "label_ar": "الأذكار", "image": "https://res.cloudinary.com/drlpkuf9q/image/upload/w_300,h_200,c_fill/v1769108367/ChatGPT_Image_22._Jan._2026_19_59_18_wilnnq.jpg"},
    "duaa":    {"label_de": "Duaa", "label_ar": "الدعاء", "image": "https://res.cloudinary.com/drlpkuf9q/image/upload/w_300,h_200,c_fill/v1769108646/3667038_a84e85abcb6b6a8b7cb55e3cd10b50b6_ulqz2k.jpg"},
    "quran":   {"label_de": "Koran", "label_ar": "القرآن", "image": "https://res.cloudinary.com/drlpkuf9q/image/upload/w_300,h_200,c_fill/v1769108672/OIP_x1q90e.webp"},
    "hadith":  {"label_de": "Hadith", "label_ar": "الحديث", "image": "https://res.cloudinary.com/drlpkuf9q/image/upload/w_300,h_200,c_fill/v1769108844/8xIOHiFRWEU6DwNdTJqFgB05fnQvaLa2h2IPACiB_cwsfpa.webp"},
}

RAMADAN_CONTENT = {
    1: {
        "title": "1 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ ارْحَمْنِي بِالْقُرْآنِ، وَاجْعَلْهُ لِي إِمَامًا وَنُورًا، وَهُدًى وَرَحْمَةً."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ:لا يُؤْمِنُ أَحَدُكُمْ حَتَّىٰ يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ."}],
            },
        },
    },

    2: {
        "title": "2 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً هَنِيَّةً، وَمِيتَةً سَوِيَّةً، وَمَرَدًّا غَيْرَ مُخْزٍ وَلَا فَاضِحٍ"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: خَالِقِ النَّاسِ بِخُلُقٍ حَسَنٍ "}],
            },
        },
    },

    3: {
        "title": "3 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: يَا غُلَامُ، سَمِّ اللَّهَ، وَكُلْ بِيَمِينِكَ، وَكُلْ مِمَّا يَلِيكَ."}],
            },
        },
    },
    4: {
        "title": "4 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الدُّعَاءِ، وَخَيْرَ النَّجَاحِ، وَخَيْرَ الْعِلْمِ، وَخَيْرَ الْعَمَلِ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: مَنْ صَلَّى عَلَيَّ صَلَاةً وَاحِدَةً، صَلَّى اللَّهُ عَلَيْهِ بِهَا عَشْرًا."}],
            },
        },
    },
    5: {
        "title": "5 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                   {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ، وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ، وَالْفَوْزَ بِالْجَنَّةِ، وَالنَّجَاةَ مِنَ النَّارِ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ."}],
            },
        },
    },
    6: {
        "title": "6 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا تَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعْصِيَتِكَ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ، وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ."}],
            },
        },
    },
    7: {
        "title": "7 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ لَا تَدَعْ لَنَا ذَنْبًا إِلَّا غَفَرْتَهُ، وَلَا هَمًّا إِلَّا فَرَّجْتَهُ، وَلَا دَيْنًا إِلَّا قَضَيْتَهُ، يَا أَرْحَمَ الرَّاحِمِينَ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: أَكْمَلُ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنُهُمْ خُلُقًا."}],
            },
        },
    },
    8: {
        "title": "8 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: إِنَّ أَحَبَّ الْكَلَامِ إِلَى اللَّهِ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ."}],
            },
        },
    },
    9: {
        "title": "9 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: الْبِرُّ حُسْنُ الْخُلُقِ."}],
            },
        },
    },
    10: {
        "title": "10 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                   {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ أَنْتَ رَبِّي، لَا إِلٰهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: مَنْ أَحَبَّ أَنْ يُبْسَطَ لَهُ فِي رِزْقِهِ، وَيُنْسَأَ لَهُ فِي أَثَرِهِ، فَلْيَصِلْ رَحِمَهُ."}],
            },
        },
    },
    11: {
        "title": "11 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ إِنِّي أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: إِنَّمَا بُعِثْتُ لِأُتَمِّمَ مَكَارِمَ الْأَخْلَاقِ."}],
            },
        },
    },
    12: {
        "title": "12 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                   {"text": " صِيَامِ اليوم"},
                ],
            },
           "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ، أَوْ بِأَحَدٍ مِنْ خَلْقِكَ، فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: إِذَا جَاءَ رَمَضَانُ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ، وَغُلِّقَتْ أَبْوَابُ النَّارِ، وَصُفِّدَتِ الشَّيَاطِينُ."}],
            },
        },
    },
    13: {
        "title": "13 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، وَعَافِنِي فِي سَمْعِي، وَعَافِنِي فِي بَصَرِي، لَا إِلٰهَ إِلَّا أَنْتَ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ."}],
            },
        },
    },
    14: {
        "title": "14 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "حَسْبِيَ اللَّهُ، لَا إِلٰهَ إِلَّا هُوَ، عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "كان رَسُولُ اللَّهِ ﷺ إِذَا أَفْطَرَ فال: ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ الْعُرُوقُ، وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللَّهُ."}],
            },
        },
    },
    15: {
        "title": "15 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، وَفِي دِينِي وَدُنْيَايَ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: اقْرَؤُوا الْقُرْآنَ، فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لِأَصْحَابِهِ."}],
            },
        },
    },
    16: {
        "title": "16 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، وَاحْفَظْنِي مِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: الصِّيَامُ جُنَّةٌ."}],
            },
        },
    },
    17: {
        "title": "17 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ، وَهُوَ السَّمِيعُ الْعَلِيمُ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ."}],
            },
        },
    },
    18: {
        "title": "18 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ ﷺ نَبِيًّا."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: تَسَحَّرُوا، فَإِنَّ فِي السَّحُورِ بَرَكَةً."}],
            },
        },
    },
    19: {
        "title": "19 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                   {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى."}],
            },
        },
    },
    20: {
        "title": "20 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ."}],
            },
        },
    },
    21: {
        "title": "21 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا، رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: أَفْضَلُ الذِّكْرِ لَا إِلٰهَ إِلَّا اللَّهُ."}],
            },
        },
    },
    22: {
        "title": "22 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                   {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ اعْفُ عَنَّا، وَاغْفِرْ لَنَا، وَارْحَمْنَا، أَنْتَ مَوْلَانَا، فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: مَنْ لَا يَرْحَمُ النَّاسَ لَا يَرْحَمْهُ اللَّهُ."}],
            },
        },
    },
    23: {
        "title": "23 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "رَبَّنَا أَتْمِمْ لَنَا نُورَنَا، وَاغْفِرْ لَنَا، إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ، يَشُدُّ بَعْضُهُ بَعْضًا."}],
            },
        },
    },
    24: {
        "title": "24 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا، وَإِسْرَافَنَا فِي أَمْرِنَا، وَثَبِّتْ أَقْدَامَنَا، وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "كَانَ رَسُولُ اللَّهِ ﷺ يَجْتَهِدُ فِي الْعَشْرِ الْأَوَاخِرِ مَا لَا يَجْتَهِدُ فِي غَيْرِهِ."}],
            },
        },
    },
    25: {
        "title": "25 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ اهْدِنِي لِأَحْسَنِ الْأَخْلَاقِ، فَإِنَّهُ لَا يَهْدِي لِأَحْسَنِهَا إِلَّا أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا، فَلَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ صَلَاةٍ."}],
            },
        },
    },
    26: {
        "title": "26 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا، كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الدَّنَسِ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ."}],
            },
        },
    },
    27: {
        "title": "27 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                   {"text": " صِيَامِ اليوم"},
                ],
            },
           "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا، كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الدَّنَسِ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: مَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ."}],
            },
        },
    },
    28: {
        "title": "28 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ لَكَ أَسْلَمْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَبِكَ آمَنْتُ، وَإِلَيْكَ أَنَبْتُ، فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ"}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "كَانَ رَسُولُ اللَّهِ ﷺ إِذَا كَانَ يَوْمُ عِيدٍ خَالَفَ الطَّرِيقَ."}],
            },
        },
    },
    29: {
        "title": "29 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                    {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَبِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قالَ رَسُولُ اللَّهِ ﷺ: الدِّينُ النَّصِيحَةُ"}],
            },
        },
    },
    30: {
        "title": "30 رمضان",
        "items": {
            "fasting": {
                "title": "الصيام",
                "body": [
                   {"text": " صِيَامِ اليوم"},
                ],
            },
            "athkar": {
                "title": "الأذكار",
                "body": [
                    {"text": "أَصْـبَحْنا وَأَصْـبَحَ  (أمسينا و أمسى)  المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،"
                    "  (هذه الليلة)لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم (هذه الليلة) وَخَـيرَ ما بَعْـدَه (مابعدها) ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم (هذه الليلة) وَشَرِّ ما بَعْـدَه،"
                    " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                    
                    },
                    {
                        "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ"
                    },
                    {
                        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ"
                    },
                    {
                        "text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ، حَسْبِيَ اللّٰهُ وَنِعْمَ الْوَكِيلُ"
                    },
                ],
            },
            "duaa": {
                "title":"الدعاء",
                "body": [{"text": "اللَّهُمَّ تَقَبَّلْ مِنَّا صَالِحَ الْأَعْمَالِ، وَاجْعَلْنَا مِنْ عُتَقَاءِ شَهْرِ رَمَضَانَ."}],
            },
            "quran": {
                "title": "القرآن",
                "body": [{"text": "تلاوة القرآن"}],
            },
            "hadith": {
                "title": "الحديث",
                "body": [{"text": "قَالَ رَجُلٌ لِلنَّبِيِّ ﷺ: أَوْصِنِي. قَالَ: لَا تَغْضَبْ. فَرَدَّدَ مِرَارًا، قَالَ: لَا تَغْضَبْ."}],
            },
        },
    },
}
